<?php
/***************************************************************************************************
 * Функция: Создание полного списка категорий
 ***************************************************************************************************
 * Version 		  : 1.0 stable
 * Released		  : 24-feb-2013
 * Last Modified  : 24-feb-2013
 * Author		  : O.G <oleg_gunyakov@mail.ru>
 ***************************************************************************************************
 * Лицензия GPL v2
 ***************************************************************************************************
 * Пример работы скрипта http://t-library.org.ua
 ***************************************************************************************************
 * Для любых пожеланий или баг отчетах пишите мне : oleg_goodzon@mail.ru
 ***************************************************************************************************/
//---------------------------------------------------------------------------------------------------------------
//Базовая функция
//---------------------------------------------------------------------------------------------------------------
function categoryList($id = 0, $countBR = 0, $str = '') {
	//Получаем некоторые глобальные перменные для работы
	$objDB = $GLOBALS['objDB'];
	$objTheme = $GLOBALS['objTheme'];
	//Выбираем список категорий, являющиеся подкатегориями текущей категории
	$data = $objDB -> select("SELECT * FROM categoryList WHERE parentID=" . $id . ";");
	//Если список существует
	if ($data) {
		//Проходим по списку
		foreach ($data as $key => $val) {
			//Формируем строку вывода
			$str .= $objTheme -> addDynamic("option.tpl", Array("label" => str_repeat("&nbsp;", $countBR). $val['name'], "value" => $val['ID'], "selected" => ""));
			//Выбираем подкатегории 
			$str = categoryList($val['ID'], $countBR + 3, $str);
		}
	}
	//Возвращаем сформированую строку
	return $str;
}
?>