<?php
/***************************************************************************************************
 * Функция: Проверка переданных данных на соответсвие шаблона
 ***************************************************************************************************
 * Version 		  : 1.0 stable
 * Released		  : 24-feb-2013
 * Last Modified  : 24-feb-2013
 * Author		  : O.G <oleg_gunyakov@mail.ru>
 ***************************************************************************************************
 * Лицензия GPL v2
 ***************************************************************************************************
 * Пример работы скрипта http://t-library.org.ua
 ***************************************************************************************************
 * Для любых пожеланий или баг отчетах пишите мне : oleg_goodzon@mail.ru
 ***************************************************************************************************/
//---------------------------------------------------------------------------------------------------------------
//Базовая функция
//---------------------------------------------------------------------------------------------------------------
function checkValue($value, $format) {
	//Проверяем формат данных
	switch($format) {
		case 'numbers' :
			if (is_numeric($value)) {
				return true;
			} else {
				return false;
			}
			break;
		case 'simbols' :
			if (is_string($value)) {
				return true;
			} else {
				return false;
			}
			break;
		case 'link' :
			if (preg_match("/^(http:\/\/)?([^\/]+)/i", $value) == 1) {
				return true;
			} else {
				return false;
			}
			break;
		case 'email' :
			if (preg_match("/[0-9a-z_]+@[0-9a-z_^\.]+\.[a-z]{2,3}/i", $value) == 1) {
				return true;
			} else {
				return false;
			}
			break;
		case 'other' :
			return true;
			break;
		default :
			return false;
			break;
	}
}
?>