<?php
/***************************************************************************************************
 * Функция: Выбор папки хранения файлов
 ***************************************************************************************************
 * Version 		  : 1.0 stable
 * Released		  : 24-feb-2013
 * Last Modified  : 24-feb-2013
 * Author		  : O.G <oleg_gunyakov@mail.ru>
 ***************************************************************************************************
 * Лицензия GPL v2
 ***************************************************************************************************
 * Пример работы скрипта http://t-library.org.ua
 ***************************************************************************************************
 * Для любых пожеланий или баг отчетах пишите мне : oleg_goodzon@mail.ru
 ***************************************************************************************************/
//---------------------------------------------------------------------------------------------------------------
//Базовая функция
//---------------------------------------------------------------------------------------------------------------
function selectStorage() {
	$storage = getdate();
	$storage = $storage['yday'];
	$storage = $storage - MAX_FILES_STORAGE_COUNT * floor($storage / MAX_FILES_STORAGE_COUNT) + 1;
	if (!is_dir(FILES_STORAGE . $storage)) {
		mkdir(FILES_STORAGE . $storage, MKDIR_MODE);
	}
	if (!is_dir(IMAGES_STORAGE . $storage)) {
		mkdir(IMAGES_STORAGE . $storage);
	}
	return $storage;
}
?>
