<?php
/***************************************************************************************************
 * Скрипт: добавление авторов в БД
 ***************************************************************************************************
 * Version 		  : 1.0 stable
 * Released		  : 24-feb-2012
 * Last Modified  : 24-feb-2012
 * Author		  : O.G <oleg_gunyakov@mail.ru>
 ***************************************************************************************************
 * Лицензия GPL v2
 ***************************************************************************************************
 * Пример работы скрипта http://t-library.org.ua
 ***************************************************************************************************
 * Для любых пожеланий или баг отчетах пишите мне : oleg_goodzon@mail.ru
 ***************************************************************************************************/
//---------------------------------------------------------------------------------------------------------------
//Первоначальная инициализация
//---------------------------------------------------------------------------------------------------------------
require_once "initd.php";
//---------------------------------------------------------------------------------------------------------------
//Подключение дополнительных модулей
//---------------------------------------------------------------------------------------------------------------
require_once "extra/readValue.php";
require_once "extra/checkValue.php";
//---------------------------------------------------------------------------------------------------------------
//Если пользователю разрешено добавлять авторов
//---------------------------------------------------------------------------------------------------------------
if ($objOptions -> getOption("AuthorAdd") == "yes") {
	//Если приняты данные формы
	if (readValue("action") == "addAuthor") {
		//Читаем данные формы
		$familyName = readvalue("familyName");
		$name = readValue("name");
		//Если принятые данные соответсвуют требуемому формату
		if (checkValue($familyName, "simbols") && checkValue($name, "simbols")) {
			//Пробуем выбрать запись из БД с такими же данными
			$data = $objDB -> select("SELECT * FROM authorList WHERE name LIKE '" . $name . "' AND familyName LIKE '" . $familyName . "';");
			//Если записи в БД не сужествует
			if (!$data) {
				//Если удалось добавить запись в БД
				if ($objDB -> insert("authorList", Array("name" => $name, "familyName" => $familyName, "userID" => $objSession -> getUserID(), "datePut" => "NOW()"))) {
					//Выводим сообщение об этом
					$objTheme -> success("{LANG_ADD_TRUE}");
				}
				//Если не удалось добавить запись в БД
				else {
					//Выводим сообщение об этом
					$objTheme -> error("{LANG_ADD_FALSE}");
				}
			}
			//Если запись существует в БД
			else {
				//Выводим сообщение об этом
				$objTheme -> warning("{LANG_LINE_HAVE}");
			}
		}
		//Если принятые данные не соответсвуют требуемому формату
		else {
			//Выводим сообщение об этом
			$objTheme -> warning("{LANG_ERROR_READ_FORM}");
		}
	}
	//Если не приняты данные формы
	else {
		//Выводим форму
		$objTheme -> define(Array("MAIN_CONTENT" => "addAuthorForm.tpl"));
		$objTheme -> assign(Array("familyName" => "", "name" => "", "action" => "addAuthor"));
	}
}
//---------------------------------------------------------------------------------------------------------------
//Если пользователю запрещено добавлять авторов
//---------------------------------------------------------------------------------------------------------------
else {
	//Выводим сообщение об этом
	$objTheme -> warning("{LANG_ADD_PROHIBITED}");
}
//---------------------------------------------------------------------------------------------------------------
//Вывод шаблона в браузер и очистка памяти
//---------------------------------------------------------------------------------------------------------------
require_once "end.php";
?>
