<?php
/***************************************************************************************************
 * Скрипт: обновление информации об книге в БД
 ***************************************************************************************************
 * Version 		  : 1.1 stable
 * Released		  : 1-feb-2013
 * Last Modified  : 28-feb-2013
 * Author		  : O.G <http://vk.com/nu_rave_og>
 ***************************************************************************************************
 * Лицензия GPL v2
 ***************************************************************************************************
 * Пример работы скрипта http://t-library.org.ua
 ***************************************************************************************************
 * Для любых пожеланий или баг отчетах пишите мне : oleg_goodzon@mail.ru
 ***************************************************************************************************/
//---------------------------------------------------------------------------------------------------------------
//Первоначальная инициализация
//---------------------------------------------------------------------------------------------------------------
require_once "initd.php";
//---------------------------------------------------------------------------------------------------------------
//Подключение дополнительных модулей
//---------------------------------------------------------------------------------------------------------------
require_once "extra/readValue.php";
require_once "extra/checkValue.php";
require_once "extra/sortOptions.php";
//---------------------------------------------------------------------------------------------------------------
//Если пользователю разрешено редактировать книги
//---------------------------------------------------------------------------------------------------------------
if ($objOptions -> getOption("BookEdit") == "yes") {
	//Если идентефикатор книги имеет цифровой формат
	if (readValueNum("id")) {
		//Если пользователю разрешено редактировать все книги
		if ($objOptions -> getOption("BookEditAll") == "yes") {
			//Проверяем наличие книги в БД
			$data = $objDB -> select("SELECT * FROM booksList WHERE ID = " . readValue("id") . " AND approved LIKE 'no';");
		}
		//Если пользователю запрещено редактировать все книги
		else {
			//Проверяем наличие книги в БД и что книга принадлежит пользователю
			$data = $objDB -> select("SELECT * FROM booksList WHERE ID = " . readValue("id") . " AND userID = " . $objSession -> getUserID() . " AND approved LIKE 'no';");
		}
		//Если проверки книги прошли успешно
		if ($data) {
			//Получаем обновленные данные об книге
			$arrBook = Array();
			$arrBook['name'] = readValue("name");
			$arrBook['descr'] = readValue("descr");
			$arrBook['smallDescr'] = readValue("smallDescr");
			$arrBook['year'] = readValueNum("year");
			if (is_array($arrFullOptions)) {
				foreach ($arrFullOptions as $key => $val) {
					if (readValue($key)) {
						$arrBook[$key] = readValue($key);
					}
				}
			}
			$arrBook['approved'] = readValue("approved");
			//Сбрасываем список ошибок
			$error = "";
			//Проходим по всем данным формы
			foreach ($arrBook as $key => $val) {
				//Если данные не соответсвуют шаблону
				if (!checkValue($val, "simbols")) {
					//Формируем список ошибок
					$error .= $objTheme -> addDynamic("liFalse.tpl", Array("LI_CONTENT" => "{LANG_MISSING} " . $key));
				}
			}
			//Если год издания имеет не цифровой формат
			if (!checkValue($arrBook['year'], "numbers")) {
				//Формируем список ошибок
				$error .= $objTheme -> addDynamic("liFalse.tpl", Array("LI_CONTENT" => "{LANG_ERROR_READ_FORM}"));
			}
			//Если список ошибок пуст
			if (empty($error)) {
				//Если удалось обновить данные об книге
				if ($objDB -> update("booksList", $arrBook, Array("ID" => readValue("id")))) {
					//Выводим сообщение об этом
					$objTheme -> success("{LANG_UPDATE_TRUE}");
				}
				//Если не удалось обновить данные об книге
				else {
					//Выводим сообщение об этом
					$objTheme -> error("{LANG_UPDATE_FALSE}" . $objDB -> getError());
				}
			}
			//Если список ошибок не пуст
			else {
				//Выводим список ошибок
				$objTheme -> warning($error);
			}
		}
		//Если проверки книги прошли не успешно
		else {
			//Выводим сообщение об этом
			$objTheme -> warning("{LANG_HAVE_NO_ELEMENT}");
		}
	}
	//Если идентефикатор книги имеет не цифровой формат
	else {
		//Выводим сообщение об этом
		$objTheme -> warning("{LANG_ERROR_READ_FORM}");
	}
}
//----------------------------------------------------------------------------------------------------------------
//Если пользователю запрещено редактировать книги
//----------------------------------------------------------------------------------------------------------------
else {
	$objTheme -> warning("{LANG_EDIT_PROHIBITED}");
}
//----------------------------------------------------------------------------------------------------------------
//Вывод шаблона и очистка памяти
//----------------------------------------------------------------------------------------------------------------
require_once "end.php";
?>
