<?php
/***************************************************************************************************
 * Скрипт: работа с файлами и записями об файлах в БД
 ***************************************************************************************************
 * Version 		  : 1.0 stable
 * Released		  : 20-feb-2013
 * Last Modified  : 20-feb-2013
 * Author		  : O.G <oleg_gunyakov@mail.ru>
 ***************************************************************************************************
 * Лицензия GPL v2
 ***************************************************************************************************
 * Пример работы скрипта http://t-library.org.ua
 ***************************************************************************************************
 * Для любых пожеланий или баг отчетах пишите мне : oleg_goodzon@mail.ru
 ***************************************************************************************************/
//---------------------------------------------------------------------------------------------------------------
//Первоначальная инициализация
//---------------------------------------------------------------------------------------------------------------
require_once "initd.php";
//---------------------------------------------------------------------------------------------------------------
//Подключение дополнительных модулей
//---------------------------------------------------------------------------------------------------------------
require_once "extra/readValue.php";
require_once "extra/selectStorage.php";
require_once "extra/convertFileName.php";
//----------------------------------------------------------------------------------------------------------------
//Если пользователю разрешено редактировать книги
//---------------------------------------------------------------------------------------------------------------
if ($objOptions -> getOption("BookEdit") == "yes") {
	//Если переданные данные имеют цифровой формат
	if (readValueNum("bookID")) {
		//Если пользователю разрешено редактировать все книги
		if ($objOptions -> getOption("BookEditAll") == "yes") {
			//Проверяем наличие книги в БД
			$data = $objDB -> select("SELECT * FROM booksList WHERE ID = " . readValue("bookID") . " AND approved LIKE 'no';");
		}
		//Если пользователю запрещено редактировать все книги
		else {
			//Проверяем наличие книги в БД и что книга принадлежит пользователю
			$data = $objDB -> select("SELECT * FROM booksList WHERE ID = " . readValue("bookID") . " AND userID = " . $objSession -> getUserID() . " AND approved LIKE 'no';");
		}
		//Если проверки книги прошли успешно
		if ($data) {
			switch(readValue("action")) {
				//-----------------------------------------------------------------------------------------------------------
				//Если событие "Привязать файл к книге"
				//-----------------------------------------------------------------------------------------------------------
				case "addToBook" :
					//Получаем данные
					$fileName = readValue("localFileName");
					$storage = selectStorage();

					if (empty($fileName)) {
						$fileName = readValue("remoteFileName");
						$storage = 0;
					}
					//-------------------------------------------------------------------------------------------------------
					//Создаем массив с информацией об файле
					//-------------------------------------------------------------------------------------------------------
					$arrFile = Array();
					$arrFile['pages'] = readValueNum('pages');
					$arrFile['fileFormat'] = readValue('fileFormat');
					$arrFile['fileName'] = convertFileName($fileName);
					$arrFile['bookID'] = readValueNum("bookID");
					//-------------------------------------------------------------------------------------------------------
					//Если формат принятых данных верен
					//-------------------------------------------------------------------------------------------------------
					if ($arrFile['pages'] && $arrFile['fileFormat'] && $arrFile['fileName'] && $arrFile['bookID']) {
						$data = $objDB -> select("SELECT COUNT(ID) FROM booksFileList WHERE bookID = " . $arrFile["bookID"] . ";");
						//Если кол-во файлов привязанык к книге не превышает лимит
						if (@$data[0]['COUNT(ID)'] < MAX_FILE_COUNT) {
							//-----------------------------------------------------------------------------------------------
							//Если файл локальный
							//-----------------------------------------------------------------------------------------------
							if ($storage > 0) {
								//Если файл присутсвует в папке пользователя
								if (is_file(USER_STORAGE . $objSession -> getUserPath() . "/" . $fileName)) {
									//Если в папке хранения не существует файла с таким же именем
									if (!is_file(FILES_STORAGE . $storage . "/" . $fileName)) {
										//Если удалось скопировать файл из папки пользователя в папку хранения
										if (copy(USER_STORAGE . $objSession -> getUserPath() . "/" . $fileName, FILES_STORAGE . $storage . "/" . $arrFile['fileName'])) {
											//Удаляем файл из папки пользователя
											unlink(USER_STORAGE . $objSession -> getUserPath() . "/" . $fileName);
											//Получаем дополнительную информацию об файле
											$arrFile['fileSize'] = filesize(FILES_STORAGE . $storage . "/" . $arrFile['fileName']);
											$arrFile['storage'] = $storage;
											//Если удалось добавить запись в базу
											if ($objDB -> insert("booksFileList", $arrFile)) {
												//Выводим об этом сообщение
												$objTheme -> success("{LANG_ADD_TRUE}");
											}
											//Если не удалось добавить запись в базу
											else {
												//Выводим сообщение об этом
												$objTheme -> error("{LANG_ADD_FALSE}");
											}
										}
										//Если не удалось скопировать файл из папки пользователя в папку хранения
										else {
											//Выводим сообщение об этом
											$objTheme -> error("{LANG_FILE_FALSE}");
										}
									}
									//Если в папке хранения существует файл с таким же именем
									else {
										//Выводим сообщение об этом
										$objSession -> warning("{LANG_FILE_SAME_NAME}");
									}
								}
								//Если файл отсутсвует в папке пользователя
								else {
									//Выводим сообщение об этом
									$objTheme -> error("{LANG_FILE_NO_PRESENT}");
								}
							}
							//-----------------------------------------------------------------------------------------------
							//Если файл удаленный(добавляется только ссылка в базу)
							//-----------------------------------------------------------------------------------------------
							else {
								//Получаем дополнительную информацию об файле
								$arrFile['fileSize'] = readValueNum("fileSize");
								//Если удалось добавить запись в базу
								if ($objDB -> insert("booksFileList", $arrFile)) {
									//Выводим об этом сообщение
									$objTheme -> success("{LANG_ADD_TRUE}");
								}
								//Если не удалось добавить запись в базу
								else {
									//Выводим сообщение об этом
									$objTheme -> error("{LANG_ADD_FALSE}");
								}
							}
						}
						//Если кол-во файлов привязанык к книге превышает лимит
						else {
							//Выводим сообщение об этом
							$objTheme -> error("{LANG_LIMIT_REACHED}");
						}
					}
					//-------------------------------------------------------------------------------------------------------
					//Если формат принятых данных не верен
					//-------------------------------------------------------------------------------------------------------
					else {
						//Выводим сообщение об этом
						$objTheme -> warning("{LANG_ERROR_READ_FORM}");
					}
					break;
				//-----------------------------------------------------------------------------------------------------------
				//Если событие "Удалить привязку файла к книге"
				//-----------------------------------------------------------------------------------------------------------
				case "delFromBook" :
					//Если формат принятых данных верен
					if (readValueNum("bookID") && readValueNum("fileID")) {
						//Получаем информацию об записи
						$data = $objDB -> select("SELECT * FROM booksFileList WHERE bookID = " . readValue("bookID") . " AND ID = " . readValue("fileID") . ";");
						//Если запись присутсвует в базе
						if ($data) {
							//Получаем массив с данными
							$data = $data[0];
							//Если файл локальный
							if ($data['storage'] > 0) {
								//Если удалось удалить файл из папки хранения либо идет принудительное удаление
								if (@unlink(FILES_STORAGE . $data['storage'] . "/" . $data['fileName']) || readValue("forceDel") == "yes") {
									//Если удалось удалить запись из базы
									if ($objDB -> delete("booksFileList", Array("bookID" => readValue("bookID"), "ID" => readValue("fileID")))) {
										//Выводим сообщение об этом
										$objTheme -> success("{LANG_DEL_TRUE}");
									}
									//Если не удалось удалить запись из базы
									else {
										//Выводим сообщение об этом
										$objTheme -> error("{LANG_DEL_FALSE}");
									}
								}
								//Если не удалось удалить файл из папки хранения
								else {
									//Выводим сообщение об этом
									$objTheme -> error("{LANG_FILE_UNLINK_ERROR}");
								}
							}
							//Если файл удаленный
							else {
								//Если удалось удалить запись из базы
								if ($objDB -> delete("booksFileList", Array("bookID" => readValue("bookID"), "ID" => readValue("fileID")))) {
									//Выводим сообщение об этом
									$objTheme -> success("{LANG_DEL_TRUE}");
								}
								//Если не удалось удалить запись из базы
								else {
									//Выводим сообщение об этом
									$objTheme -> error("{LANG_DEL_FALSE}");
								}
							}
						}
						//Если запись отсутствует в базе
						else {
							//Выводим сообщение об этом
							$objTheme -> warning("{LANG_LINE_EMPTY}");
						}
					}
					//Если формат принятых данных не верен
					else {
						//Выводим сообщение об этом
						$objTheme -> warning("{LANG_ERROR_READ_FORM}");
					}
					break;
				//-----------------------------------------------------------------------------------------------------------
				//Если событие не определенно
				//-----------------------------------------------------------------------------------------------------------
				default :
					//Выводим сообщение об этом
					$objTheme -> warning("{LANG_ERROR_READ_FORM}");
					break;
			}
		}
		//Если проверки книг прошли не успешно
		else {
			//Выводим сообщение об этом
			$objTheme -> warning("{LANG_HAVE_NO_ELEMENT}");
		}
	}
	//Если идентефикатор книги не цифровой
	else {
		//Выводим сообщение об этом
		$objTheme -> warning("{LANG_ERROR_READ_FORM}");
	}
}
//----------------------------------------------------------------------------------------------------------------
//Если пользователю запрещено редактировать книги
//----------------------------------------------------------------------------------------------------------------
else {
	//Выводим сообщение об этом
	$objTheme -> warning("{LANG_EDIT_PROHIBITED}");
}
//---------------------------------------------------------------------------------------------------------------
//Вывод шаблона в браузер и очистка памяти
//---------------------------------------------------------------------------------------------------------------
require_once "end.php";
?>
