<?php
/***************************************************************************************************
 * Скрипт: первоначальная инициализация
 ***************************************************************************************************
 * Version 		  : 1.0 stable
 * Released		  : 05-jan-2013
 * Last Modified  : 06-feb-2013
 * Author		  : O.G <oleg_gunyakov@mail.ru>
 ***************************************************************************************************
 * Лицензия GPL v2
 ***************************************************************************************************
 * Пример работы скрипта http://t-library.org.ua
 ***************************************************************************************************
 * Для любых пожеланий или баг отчетах пишите мне : oleg_goodzon@mail.ru
 ***************************************************************************************************/
//Функция для получения текущего времени
function getmicrotime() {
	list($usec, $sec) = explode(" ", microtime());
	return ((float)$usec + (float)$sec);
}
//Получаем время начала выполнения скрипта
$time_start = getmicrotime();
//----------------------------------------------------------------------------------------------------------------
//Получаем настройки
//----------------------------------------------------------------------------------------------------------------
require_once "config.php";
//----------------------------------------------------------------------------------------------------------------
//Загружаем в памать класс для работы с БД
//----------------------------------------------------------------------------------------------------------------
require_once "class/class.DB.php";
global $objDB;
$objDB = new DB();
//----------------------------------------------------------------------------------------------------------------
//Загружаем в память класс для работы с сессией пользователя
//----------------------------------------------------------------------------------------------------------------
require_once "class/class.UserSession.php";
global $objSession;
$objSession = new UserSession($objDB);
//----------------------------------------------------------------------------------------------------------------
//Загружем в память класс для чтения настроек пользователя
//----------------------------------------------------------------------------------------------------------------
require_once "class/class.Options.php";
global $objOptions;
$objOptions = new Options();
//----------------------------------------------------------------------------------------------------------------
//Загружаем в память класс для работы с шаблонами
//----------------------------------------------------------------------------------------------------------------
require_once "class/class.Template.php";
global $objTheme;
$objTheme = new Template(THEME_PATH);
//----------------------------------------------------------------------------------------------------------------
//Устанавливаем некоторые опции шаблона
//----------------------------------------------------------------------------------------------------------------
$objTheme -> assign(Array("THEME_PATH" => THEME_PATH, "USER_NAME" => $objSession -> getUserName()));
//----------------------------------------------------------------------------------------------------------------
//Проверка пользователя на авторизацию
//----------------------------------------------------------------------------------------------------------------
if (!$objSession -> getUserID() && strpos($_SERVER['SCRIPT_NAME'], "login.php") == false) {
	//Вывод формы для входа, если не авторизированны
	$objTheme -> defineMain("loginForm.tpl");
	//Вывод шаблона в браузер
	require_once "end.php";
	//Прерывание дальнейшего выполнения скрипта
	exit();
}
//-------------------------------------------------------------------------------------------------------------------------
//Получаем из базы кол-во новых тикетов.
//-------------------------------------------------------------------------------------------------------------------------
$data = $objDB -> select("SELECT COUNT(ID) FROM tiket WHERE state = 'answer' AND userID = " . $objSession -> getUserID() . ";");
if($data) {
	$objTheme->assign(Array("TIKET_COUNT" => $data[0]['COUNT(ID)']));
}
else {
	$objTheme -> assign(Array("TIKET_COUNT" => "0"));
}
?>
