<?php
/***************************************************************************************************
 * Скрипт: обработка загрузки файлов
 ***************************************************************************************************
 * Version 		  : 1.0 stable
 * Released		  : 20-feb-2013
 * Last Modified  : 20-feb-2013
 * Author		  : O.G <oleg_gunyakov@mail.ru>
 ***************************************************************************************************
 * Лицензия GPL v2
 ***************************************************************************************************
 * Пример работы скрипта http://t-library.org.ua
 ***************************************************************************************************
 * Для любых пожеланий или баг отчетах пишите мне : oleg_goodzon@mail.ru
 ***************************************************************************************************/
require_once "config.php";

require_once "class/class.DB.php";
global $objDB;
$objDB = new DB();

require_once "class/class.UserSession.php";
global $objSession;
$objSession = new UserSession();

if ($objSession -> getUserID()) {
	require ('class/class.Upload.php');
	$upload_handler = new UploadHandler();
}
?>