<?php
//-------------------------------------------------------------------------------------------------------------------------
// Модуль: вывод текстового файла постранично
//-------------------------------------------------------------------------------------------------------------------------
// Version 		  : 2.0 b
// Released		  : 28-feb-2013
// Last Modified          : 09-jun-2014
// Author		  : O.G <http://o-g.promodj.ru>
//-------------------------------------------------------------------------------------------------------------------------
// Лицензия GPL v2
//-------------------------------------------------------------------------------------------------------------------------
// Пример работы скрипта http://demo.dub-project.ru
//-------------------------------------------------------------------------------------------------------------------------
// Для любых пожеланий или баг отчетах пишите мне : og@dub-project.ru
//-------------------------------------------------------------------------------------------------------------------------

//Кол-во символов на страницу
$pageLength = 2048;
//Читаем файл в переменную
$fileContent = file_get_contents($fileName);
//------------------------------------------------------------------------------------------------------------------------
//Получаем общее количество страниц книги
//------------------------------------------------------------------------------------------------------------------------
$totalPages = ceil(strlen($fileContent) / $pageLength);
//-------------------------------------------------------------------------------------------
//Переключаемся между режимами чтения файла
//-------------------------------------------------------------------------------------------
switch(readValue("mode")) {
	//Если режим вывода файла - изображение
	case "image" :
		$mode = "image";
		//Выводим сообщение об запрете вывода изображения при текстовом формате
		$readContent = $objTheme -> addDynamic("error.tpl", Array("ERROR_CONTENT" => "{LANG_ERROR_READ_FILE_FORMAT}"));
		break;
	//Утанавливаем режим чтения файла по умолчанию.
	default :
		$mode = "text";
		//----------------------------------------------------------------------------------------------------
		//Проверка текущего номера страницы на вхождение в диапазон общего количества страниц книги
		//----------------------------------------------------------------------------------------------------
		//Если текущий номер страници больше количества страниц в файле
		if ($currentPage > $totalPages) {
			//Устанавливаем текущий номер страницы в максимально возможный
			$currentPage = $totalPages;
		}
		//$fileContent = file($fileName);
		$fileContent = str_replace(chr(13), "<br>", $fileContent);
		//Далее код открытия и чтения файла.
		$readContent = substr($fileContent, ($currentPage - 1) * $pageLength, $pageLength);
		break;
}
?>
