<!-- Heading  -->
<div class="row-fluid">
	<div class="span12">
		<h1>Помощь</h1>
		<p class="lead">
			Порядок добавления книги на сайт.
		</p>
	</div>
</div>
<!--  End Heading-->
<div class="row-fluid">
	<div class="span12">
		<p>
			<b>Раздел 1.</b> Загрузка файлов в проэкт.
		</p>
		<p align="justify">
			Загрузка файлов не должна вызывать особых трудностей. Для этого перейдите в меню Файловый менеджер,
			выберите требуемые файлы и нажмите кнопку "Загрузить". Через некоторое время файлы будут загружены на сервер.
			Разрешено загружать не более 5 файлов одновременно и размер файла не более 120 мб.
		</p>
		<p>
			<b>Раздел 2.</b> Добавление записи об книге.
		</p>
		<p align="justify">
			После того, как файлы были загружены, следуите "Добавить" -> "Книгу". Появится форма добавления записи об книге.
			Заполните форму и нажмите кнопку отправить. Если форма заполнена коректно, запись будет добавленна в базу данных.
		</p>
		<p>
			<b>Раздел 3.</b> Редактирование записи об книге.
		</p>
		<p align="justify">
			После добавления записи об книге, необходимо привязать к этой записи файлы, категории, авторов и издательство.
			Для этого следуйте "Редактировать" -> "Книгу". Появится список добавленных записей об книге. Нажмите на иконку ручки и перед Вами появится форма редактирования записи об книге.
			Привяжите к книге категории, авторов, файлы. После того, как запись будет полностью отредактированна, выберите что оформление книги законченно, и отправьте данную форму. Сервер примет информацию, и запись будет переданна на расмотрение администрации.
			В случае корректного оформления, книга появиться на страницах сайта. В противном случае книга будет возвращена на доработку.
		</p>
		<p>
			<b>Раздел 4.</b> Автора и издательства
		</p>
		<p align="justify">
			Может случиться так, что автора книги либо издательства еще нет в базе. Вы можете самостоятельно добавить необходимые записи в базу. Для этого следуйте "Добавить" и выберите необходимый пункт.
			Если по какой то причине вы ошиблись, либо запись об авторе вам уже не нужена, вы можете оредактировать или удалить запись. Для этого следуйте "Редактировать". То же самое вы можете проделать и с издательствами.
		</p>
		<p>
			<b>Раздел 5.</b> Привязка файлов.
		</p>
		<p align="justify">
			На данном пункте нужно дополнительно остановиться. Файлы, загруженные пользователем, хранятся с пециально созданом для этого каталоге. В момент привязки файла к книге, файл переноситься из каталога пользователя в каталог хранения. Данное действие
			односторонее. Вернуть файл в каталог пользователя больше нельзя. В случае, если вы привязали не тот файл и удалили привязку, то и файл будет удален из каталога хранения. Будьте внимательны при привязки файлов к книге.
			Сайт может работать с удаленными файлами, но мы принимаем только локальные файлы для обработки. Книга, к которой привязаны удаленный файлы, будет возвращена на доработку.
		</p>
		<p>
			<b>Раздел 6.</b> Обложка и изображения предварительного просмотра.
		</p>
		<p align="justify">
			При оформлении книги вы можете загружать изображения на наш сервер и привязывать их к книге. Так же вы можете размещать изображения на удаленных хостингах В этом случае изображения
			должны быть доступны по прямым ссылкам. Для облегчения жизни пользователям, я разработал скрипт под названием Магический создатель изображений. После привязки файлов к книге, перейдите по данной ссылке, выберите один из доступных файлов и нажмите создать изображения.
			Скрипт автоматически создаст 5 изображений из книги с одинаковыми интервалами между страницами, сам позаботится об привязке созданных изображений к книге. Скрипт автоматически первую страницу распознает как обложку.
		</p>
		<p>
			<b>Раздел 7.</b> Дополнительная помощь.
		</p>
		<p align="justify">
			В случае, если у вас возникли проблемы либо пожелания при работе с нашим сайтом, отправьте нам либо письмо на адресс <a href="mailto:help@t-library.org.ua">help@t-library.org.ua</a>, либо <a href="tiket.php">тикет</a>.
		</p>
	</div>
</div>