<!-- Heading  -->
<div class="row-fluid">
	<div class="span12">
		<h1>Добро пожаловать.</h1>
		<p class="lead">
			ДУБ Книжный менеджер приветсвует вас.
		</p>
	</div>
</div>
<div class="row-fluid">
<div class="span12">
    <p>Здесь вы сможете добавить книги и прикрепить файлы к ним.</p>
    <p>Так же вы сможете добавлять и редактировать авторов и издательства, если это разрешено вам администратором.</p>
    <p>Если при работе с менеджером у вас возникли проблемы - напишите нам тикет об этом, и мы постараемся вам помочь.</p>
    <p>Если при работе с менеждером у вас возникли трудности - почитайте документацию. Там все доступно описанно.</p>
</div>
<br><br><br><br><br><br><br><br><br><br><br><br>