<?php
/***************************************************************************************************
 * Скрипт: Добавление категорий в БД
 ***************************************************************************************************
 * Version 		  : 1.0 stable
 * Released		  : 02-dec-2012
 * Last Modified  : 31-feb-2013
 * Author		  : O.G <oleg_gunyakov@mail.ru>
 ***************************************************************************************************
 * Лицензия GPL v2
 ***************************************************************************************************
 * Пример работы скрипта http://t-library.org.ua
 ***************************************************************************************************
 * Для любых пожеланий или баг отчетах пишите мне : oleg_goodzon@mail.ru
 ***************************************************************************************************/
//----------------------------------------------------------------------------------------------------------------
//Первоначальная инициализация
//----------------------------------------------------------------------------------------------------------------
require_once "initd.php";
//----------------------------------------------------------------------------------------------------------------
//Подключение дополнительных модулей
//----------------------------------------------------------------------------------------------------------------
require_once "extra/readValue.php";
require_once "extra/createSelect.php";
//----------------------------------------------------------------------------------------------------------------
//Если сервер получил данные
//----------------------------------------------------------------------------------------------------------------
if (readValue("action") == "post") {
	//Сбрасываем значения
	$data = Array();
	//Читаем данные
	$data['name'] = readValue('categoryName');
	$data['parentID'] = readValueNum('parentID');
	$data['descr'] = readValue('categoryDescr');
	if(empty($data['descr'])) {
		$data['descr'] = "";
	}
	//Если принятые данные имеют нужный формат
	if ($data['name'] && $data['parentID']) {
		if ($data['parentID'] < 0) {
			$data['parentID'] = 0;
		}
		//Если существует родительская категория либо это ROOT категория
		if ($objDB -> select("SELECT * FROM categoryList WHERE ID = " . $data['parentID'] . ";") || $data['parentID'] == 0) {
			//Если удалось добавить запись в БД
			if ($objDB -> insert("categoryList", $data)) {
				//Выводим сообщение об этом
				$objTheme -> success("{LANG_ADD_TRUE}");
			}
			//Если не удалось добавить запись в БД
			else {
				//Выводим сообщение об этом
				$objTheme -> error("{LANG_ADD_FALSE}.".$objDB->getError());
			}
		}
		//Если не существует родительская категория
		else {
			//Выводим сообщение об этом
			$objTheme -> warning("{LANG_LINE_EMPTY}");
		}
	}
	//Если принятые данные имеют неправильный формат
	else {
		$objTheme -> error("{LANG_ERROR_READ_FORM}");
	}
}
//----------------------------------------------------------------------------------------------------------------
//Если сервер не получил данные
//----------------------------------------------------------------------------------------------------------------
else {
	//Выводим форму добавления категорий
	$objTheme -> define(Array("MAIN_CONTENT" => "addCategory.tpl"));
	//Выводим уже существующий список категорий
	$objTheme -> assign(Array("SELECT_CATEGORY_CONTENT" => createSelect()));
}
//----------------------------------------------------------------------------------------------------------------
//Вывод шаблона и очистка памяти
//----------------------------------------------------------------------------------------------------------------
require_once "end.php";
?>
