<?php
//--------------------------------------------------------------------------------------------------
//Настройки для соеденения с базой данных
//--------------------------------------------------------------------------------------------------
//Имя сервера базы данных
define("DB_LOCATION", "localhost");
//Имя базы данных
define("DB_NAME", "techlibrary_library");
//Имя пользователя, для соеденения с базой данных
define("DB_USER", "techlibrary_library");
//Пароль пользователя, для соеденения с базой данных
define("DB_PASSWORD", "");
//--------------------------------------------------------------------------------------------------
//Настройки каталогов
//--------------------------------------------------------------------------------------------------
//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!Предупреждение!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//--------------------------------------------------------------------------------------------------
//Настройки каталогов и путей к ним ВСЕГДА ДОЛЖНЫ оканчиваться значащим символом "/"
//--------------------------------------------------------------------------------------------------
//Режим создания папок
define("MKDIR_MODE", 0755);
//Браузерный путь к папке, откуда будет происходить загрузка файлов
//define("FILES_DOWNLOAD_LINK", "http://storage.t-library.org.ua/");
define("FILES_DOWNLOAD_LINK", "https://download.t-library.net/");
//Абсолютный путь к папке, где находятся файлы для загрузки
//Если используется прямой доступ к файлам, то эта папка должна быть доступна через FILES_DOWNLOAD_LINK
define("FILES_STORAGE", "/home/techlibrary/web/storage.t-library.net/public_html/");
//Абсолютный путь к папке, где будут храниться символические ссылки
//Если используются символические ссылки, то эта папка должна быть доступна через FILES_DOWNLOAD_LINK
define("FILES_SIMLINK_STORAGE", "/home/techlibrary/web/download.t-library.net/public_html/");
//Загрузка фаилов по прямой ссылке, если - true
//Загрузка фаилов по символическим ссылкам, если - false
define("FILES_DIRECT_LINK", false);
//Браузерный путь к папке с изображениями
define("IMAGES_DOWNLOAD_LINK", "https://image.t-library.net/");
//Абсолютный путь к папке с изображениями
define("IMAGES_STORAGE", "/home/techlibrary/web/image.t-library.net/public_html/");
//Браузерный путь к папке с создаваемыми изображениями
define("USER_IMAGE_DOWNLOAD_LINK", "https://download.t-library.net/");
//Абсолютный путь к папке с создаваемыми изображениями
define("USER_IMAGE_STORAGE", "/home/techlibrary/web/download.t-library.net/public_html/");
//Абсолютный путь к TEMP папке
define("TEMP_STORAGE", "/home/techlibrary/tmp/");
//Холодное хранение файлов
define("FILES_COLD_LINK", "http://cold.t-library.net/");
//--------------------------------------------------------------------------------------------------
//Пути к исполняемым командам
//--------------------------------------------------------------------------------------------------
define("ddjvu", "/usr/bin/ddjvu");
define("convert", "/usr/bin/convert");
define("tesseract", "/usr/bin/tesseract");
define("gs", "/usr/bin/gs");
//--------------------------------------------------------------------------------------------------
//Настройки модуля PROMO VIEW
//--------------------------------------------------------------------------------------------------
//Активен ли модуль PROMO VIEW
define("PROMO_VIEW", true);
//--------------------------------------------------------------------------------------------------
//Настройки модуля AMOUNT
//--------------------------------------------------------------------------------------------------
//Активен ли модуль AMOUNT
define("AMOUNT_MODULE", true);
//--------------------------------------------------------------------------------------------------
//Настройки модуля LIMIT
//--------------------------------------------------------------------------------------------------
//Активен ли модуль лимитов
define("LIMIT_MODULE", true);
//--------------------------------------------------------------------------------------------------
//Настройки модуля SORT OPTIONS
//--------------------------------------------------------------------------------------------------
//Активен ли модуль сортировки
define("SORT_OPTIONS", true);
//--------------------------------------------------------------------------------------------------
//Настройки модуля статистики
//--------------------------------------------------------------------------------------------------
//Активен ли модуль статистики (увеличивает нагрузку на сервер)
define("STAT_MODULE", false);
//--------------------------------------------------------------------------------------------------
//Дополнительные настройки
//--------------------------------------------------------------------------------------------------
//Кол-во строк, выводимых при поиске, независит от LIMIT_MODULE
define("SEARCH_LIMIT", 10);
//Символы в имени пользователя при регистрации
//По умолчанию разрешены латинские буквы и цифры.
define("USER_NAME_PREGMATCH", "/[0-9a-z_]/i");
//Относительный путь к шаблону
define("THEME_PATH", "themes/grape_theme");
//define("THEME_PATH", "themes/flatro");
define("APROVED_BOOK_AMOUNT", 10);
?>
