<?php
/***************************************************************************************************
 * Скрипт: изменение пользовательских настроек по умолчанию
 ***************************************************************************************************
 * Version 		  : 1.0beta
 * Released		  : 14-jan-2013
 * Last Modified  : 14-jan-2013
 * Author		  : O.G <oleg_gunyakov@mail.ru>
 ***************************************************************************************************
 * Лицензия GPL v2
 ***************************************************************************************************
 * Пример работы скрипта http://t-library.org.ua
 ***************************************************************************************************
 * Для любых пожеланий или баг отчетах пишите мне : oleg_goodzon@mail.ru
 ***************************************************************************************************/
//----------------------------------------------------------------------------------------------------
//Первоначальная инициализация
//----------------------------------------------------------------------------------------------------
require_once "initd.php";
//----------------------------------------------------------------------------------------------------
require_once "extra/readValue.php";

switch(readValue('action')) {
	//-------------------------------------------------------------------------------------------------
	//Если сервер получил данные формы настроек
	//-------------------------------------------------------------------------------------------------
	case "updateOptions" :
		//Сбрасываем счетчик измененых настроек
		$i = 0;
		//Сбрасываем список ошибок
		$error = "";
		//Проходим по массиву переданных данных
		foreach ($_POST as $key => $val) {
			//Если значение равно no, yes либо цифровое
			if ($val == "no" || $val == 'yes' || is_numeric($val)) {
				//Выбираем из базы текущее значение настройки
				$data = $objDB -> select("SELECT * FROM userOptions WHERE name LIKE '" . $key . "' and userID = 0;");
				//Если настройка вообще присутсвует в базе
				if ($data) {
					//Если полученное значение отлично от текущего
					if ($val != $data[0]['value']) {
						//Если обновить настройку не удалось
						if (!$objDB -> update("userOptions", Array("value" => $val), Array("ID" => $data[0]['ID']))) {
							//Сообщаем об этом
							$error .= $objTheme -> addDynamic("liFalse.tpl", Array("LI_CONTENT" => "{LANG_UPDATE_FALSE} " . $key));
						}
						//Если обновить настройку удалось
						else {
							//Увеличиваем счетчик обновленных настроек
							$i++;
						}
					}
				}
				//Если настройка в базе отсутсвует
				else {
					//Сообщаем об этом
					$error .= $objTheme -> addDynamic("liFalse.tpl", Array("LI_CONTENT" => "{LANG_LINE_EMPTY} " . $key));
				}
			}
		}
		//---------------------------------------------------------------------------------------------
		//Если список ошибок пуст
		//---------------------------------------------------------------------------------------------
		if (empty($error)) {
			//Если счетчик обновленных настроек пуст
			if ($i == 0) {
				//Выводим предупреждение об этом
				$objTheme -> warning("{LANG_OPTION_NOTHING_UPDATE}");
			}
			//Если счетчик обновленных настрек не пуст
			else {
				//Выводим подтверждающее сообщение
				$objTheme -> success("{LANG_UPDATE_TRUE}, {LANG_OPTION_UPDATE}:" . $i);
			}
		}
		//---------------------------------------------------------------------------------------------
		//Если список ошибок не пуст
		//---------------------------------------------------------------------------------------------
		else {
			//Выводим список ошибок
			$objTheme -> error($error);
		}
		break;
	//-------------------------------------------------------------------------------------------------
	//Если сервер получил данные формы полного сброса настроек всех пользователей
	//-------------------------------------------------------------------------------------------------
	case "fullReset" :
		$objDB -> select("DELETE FROM userOptions WHERE userID > 0 AND name NOT LIKE 'CurrentCount%';");
		$objTheme -> success("{LANG_UPDATE_TRUE}");
		break;
	//-------------------------------------------------------------------------------------------------
	//Если сервер не получал данные одной из форм
	//-------------------------------------------------------------------------------------------------
	default :
		//Выводим форму настроек
		$objTheme -> define(Array("MAIN_CONTENT" => "options.tpl"));
		//Выбираем список общих настроек из базы
		$data = $objDB -> select("SELECT * FROM userOptions WHERE userID = 0;");
		//---------------------------------------------------------------------------------------------
		//Если список настроек не пуст
		//---------------------------------------------------------------------------------------------
		if ($data) {
			//Проходим по списку настроек
			foreach ($data as $key => $val) {
				//Выводим в форму значения по умолчанию
				$objTheme -> assign(Array("checked" . $val['name'] . "no" => "", "checked" . $val['name'] . "yes" => ""));
				$objTheme -> assign(Array("checked" . $val['name'] . $val['value'] => "checked"));
				$objTheme -> assign(Array($val['name'] => $val['value']));
			}
		}
		//--------------------------------------------------------------------------------------------
		//Если список настроек пуст
		//--------------------------------------------------------------------------------------------
		else {
			//Выводим сообщение об этом
			$objTheme -> error("{LANG_HAVE_NO_ELEMENT}");
		}
		break;
}
//----------------------------------------------------------------------------------------------------
//Очитска памяти и вывод страницы в браузер
//----------------------------------------------------------------------------------------------------
require_once "end.php";
?>
