<?php
/***************************************************************************************************
 * Модуль: Ограничение активности пользователя
 ***************************************************************************************************
 * Version 		  : 1.0 beta
 * Released		  : 7-mar-2013
 * Last Modified  : 7-mar-2013
 * Author		  : O.G <oleg_gunyakov@mail.ru>
 ***************************************************************************************************
 * Лицензия GPL v2
 ***************************************************************************************************
 * Пример работы скрипта http://t-library.org.ua
 ***************************************************************************************************
 * Для любых пожеланий или баг отчетах пишите мне : oleg_goodzon@mail.ru
 ***************************************************************************************************/
function Limits($optionName) {
	//Получаем глобальные переменные
	$objOptions = $GLOBALS['objOptions'];
	$objSession = $GLOBALS['objSession'];
	//--------------------------------------------------------------------------------------------------------------------------
	//Устанавливаем, что лимит текущего события по умолчанию не достигнут 
	//--------------------------------------------------------------------------------------------------------------------------
	$limit = false;
	//--------------------------------------------------------------------------------------------------------------------------
	//Если модуль лимитов разрешен настройками
	//--------------------------------------------------------------------------------------------------------------------------
	if (LIMIT_MODULE) {
		//Получаем счетчик текущего события
		$currentCount = $objOptions -> getOption("CurrentCount" . $optionName);
		//Получаем максимально возможный счетчик события для пользователя
		$maxCount = $objOptions -> getOption("Limit" . $optionName);
		//Если текущий счетчик больше либо равен максимально допустимому значению
		if ($currentCount >= $maxCount) {
			//Устанавливаем, что достигнут лимит
			$limit = true;
		}
	}
	//--------------------------------------------------------------------------------------------------------------------------
	//Если пользовательский счет разрешен
	//--------------------------------------------------------------------------------------------------------------------------
	if (AMOUNT_MODULE) {
		//Если текущий счет пользователя меньше 0, и стоимость события меньше 0
		if ($objOptions -> getOption("Amount" . $optionName) < 0 && $objSession -> getUserAmount() < 0) {
			//Устанавливаем, что достигнут лимит
			$limit = true;
		}
	}
	
	//--------------------------------------------------------------------------------------------------------------------------
	//Если пользователь не авторизирован, а ему разрешено данное действие, то лимит отменяется.
	//--------------------------------------------------------------------------------------------------------------------------
	if(!$objSession->getUserID()) {
		$limit = false;
	}
	//--------------------------------------------------------------------------------------------------------------------------
	//Выводим значение
	//--------------------------------------------------------------------------------------------------------------------------
	return $limit;
}
?>